sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
#if !defined(HEADER_CAN_H_) 
#define HEADER_CAN_H_

#include "Header.h"

/**
  * CAN TxMailBox 
*/
typedef struct
{
  __O uint32_t TIR;  /* CAN TX mailbox identifier register */
  __O uint32_t TDTR; /* CAN mailbox data length control and time stamp register */
  __O uint32_t TDLR; /* CAN mailbox data low register */
  __O uint32_t TDHR; /* CAN mailbox data high register */
} CAN_TxMailBox_RegDef_t;

/** 
  * CAN FIFO Register 
  */
typedef struct
{
  __O uint32_t RIR;  /* CAN receive FIFO mailbox identifier register */
  __O uint32_t RDTR; /* CAN receive FIFO mailbox data length control and time stamp register */
  __O uint32_t RDLR; /* CAN receive FIFO mailbox data low register */
  __O uint32_t RDHR; /* CAN receive FIFO mailbox data high register */
} CAN_FIFOMailBox_RegDef_t;

/*
  * CAN Filter Register 
  */
typedef struct
{
  __O uint32_t FR1; /* CAN Filter bank register 1 */
  __O uint32_t FR2; /* CAN Filter bank register 2 */
} CAN_FilterRegister_RegDef_t;

/*Define register for  CANx*/
typedef struct
{
	__O uint32_t MCR;                          /* CAN master control register          Address offset: 0x00*/
	__O uint32_t MSR;                          /* CAN master status register           Address offset: 0x04*/
	__O uint32_t TSR;                          /* CAN transmit status register         Address offset: 0x08*/
	__O uint32_t RF0R;                         /* CAN receive FIFO 0 register          Address offset: 0x0C*/
	__O uint32_t RF1R;                         /* CAN receive FIFO 1 register          Address offset: 0x10*/
  __O uint32_t IER;                        /* CAN interrupt enable register        Address offset: 0x14*/
	__O uint32_t ESR;                          /* CAN error status register            Address offset: 0x18*/
	__O uint32_t BTR;                          /* CAN bit timing register              Address offset: 0x1C*/
	uint32_t RESERVED0[88];                     /* Reserved,                            0x020 - 0x17F       */
  CAN_TxMailBox_RegDef_t TxMailBox[3];      /* CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC*/
	CAN_FIFOMailBox_RegDef_t FIFOMailBox[2];    /* CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
	uint32_t RESERVED1[12];                     /* Reserved, 0x1D0 - 0x1FF                              */
	__O uint32_t FMR;                          /* CAN filter master register,          Address offset: 0x200         */
  __O uint32_t FM1R;                       /* CAN filter mode register,            Address offset: 0x204         */
  uint32_t RESERVED2;                       /* Reserved, 0x208                                                    */
  __O uint32_t FS1R;                       /* CAN filter scale register,           Address offset: 0x20C         */
  uint32_t RESERVED3;                       /* Reserved, 0x210                                                    */
  __O uint32_t FFA1R;                      /* CAN filter FIFO assignment register, Address offset: 0x214         */
  uint32_t RESERVED4;                       /* Reserved, 0x218                                                    */
  __O uint32_t FA1R;                       /* CAN filter activation register,      Address offset: 0x21C         */
  uint32_t RESERVED5[8];                    /* Reserved, 0x220-0x23F                                              */ 
  CAN_FilterRegister_RegDef_t FilterRegister[28]; /* CAN Filter Register,              Address offset: 0x240-0x31C   */
} CAN_RegDef_t;
#define CAN1                ((CAN_RegDef_t *) CAN1_BASEADDR)
#define CAN2                ((CAN_RegDef_t *) CAN2_BASEADDR)

/*******************  Bit definition for CAN_MCR register  ********************/
#define CAN_MCR_INRQ_Pos       (0U)                                            
#define CAN_MCR_INRQ_Msk       (0x1UL << CAN_MCR_INRQ_Pos)                   
#define CAN_MCR_INRQ           CAN_MCR_INRQ_Msk                              
#define CAN_MCR_SLEEP_Pos      (1U)                                          
#define CAN_MCR_SLEEP_Msk      (0x1UL << CAN_MCR_SLEEP_Pos)                  
#define CAN_MCR_SLEEP          CAN_MCR_SLEEP_Msk                             
#define CAN_MCR_TXFP_Pos       (2U)                                          
#define CAN_MCR_TXFP_Msk       (0x1UL << CAN_MCR_TXFP_Pos)                   
#define CAN_MCR_TXFP           CAN_MCR_TXFP_Msk                              
#define CAN_MCR_RFLM_Pos       (3U)                                          
#define CAN_MCR_RFLM_Msk       (0x1UL << CAN_MCR_RFLM_Pos)                   
#define CAN_MCR_RFLM           CAN_MCR_RFLM_Msk                              
#define CAN_MCR_NART_Pos       (4U)                                          
#define CAN_MCR_NART_Msk       (0x1UL << CAN_MCR_NART_Pos)                   
#define CAN_MCR_NART           CAN_MCR_NART_Msk                              
#define CAN_MCR_AWUM_Pos       (5U)                                          
#define CAN_MCR_AWUM_Msk       (0x1UL << CAN_MCR_AWUM_Pos)                   
#define CAN_MCR_AWUM           CAN_MCR_AWUM_Msk                              
#define CAN_MCR_ABOM_Pos       (6U)                                          
#define CAN_MCR_ABOM_Msk       (0x1UL << CAN_MCR_ABOM_Pos)                   
#define CAN_MCR_ABOM           CAN_MCR_ABOM_Msk                              
#define CAN_MCR_TTCM_Pos       (7U)                                          
#define CAN_MCR_TTCM_Msk       (0x1UL << CAN_MCR_TTCM_Pos)                   
#define CAN_MCR_TTCM           CAN_MCR_TTCM_Msk                              
#define CAN_MCR_RESET_Pos      (15U)                                         
#define CAN_MCR_RESET_Msk      (0x1UL << CAN_MCR_RESET_Pos)                  
#define CAN_MCR_RESET          CAN_MCR_RESET_Msk                             
#define CAN_MCR_DBF_Pos        (16U)                                         
#define CAN_MCR_DBF_Msk        (0x1UL << CAN_MCR_DBF_Pos)                    
#define CAN_MCR_DBF            CAN_MCR_DBF_Msk                               
/*******************  Bit definition for CAN_MSR register  ********************/
#define CAN_MSR_INAK_Pos       (0U)                                            
#define CAN_MSR_INAK_Msk       (0x1UL << CAN_MSR_INAK_Pos)                  
#define CAN_MSR_INAK           CAN_MSR_INAK_Msk                             
#define CAN_MSR_SLAK_Pos       (1U)                                         
#define CAN_MSR_SLAK_Msk       (0x1UL << CAN_MSR_SLAK_Pos)                  
#define CAN_MSR_SLAK           CAN_MSR_SLAK_Msk                             
#define CAN_MSR_ERRI_Pos       (2U)                                         
#define CAN_MSR_ERRI_Msk       (0x1UL << CAN_MSR_ERRI_Pos)                  
#define CAN_MSR_ERRI           CAN_MSR_ERRI_Msk                             
#define CAN_MSR_WKUI_Pos       (3U)                                         
#define CAN_MSR_WKUI_Msk       (0x1UL << CAN_MSR_WKUI_Pos)                  
#define CAN_MSR_WKUI           CAN_MSR_WKUI_Msk                             
#define CAN_MSR_SLAKI_Pos      (4U)                                         
#define CAN_MSR_SLAKI_Msk      (0x1UL << CAN_MSR_SLAKI_Pos)                 
#define CAN_MSR_SLAKI          CAN_MSR_SLAKI_Msk                            
#define CAN_MSR_TXM_Pos        (8U)                                         
#define CAN_MSR_TXM_Msk        (0x1UL << CAN_MSR_TXM_Pos)                   
#define CAN_MSR_TXM            CAN_MSR_TXM_Msk                              
#define CAN_MSR_RXM_Pos        (9U)                                         
#define CAN_MSR_RXM_Msk        (0x1UL << CAN_MSR_RXM_Pos)                   
#define CAN_MSR_RXM            CAN_MSR_RXM_Msk                              
#define CAN_MSR_SAMP_Pos       (10U)                                        
#define CAN_MSR_SAMP_Msk       (0x1UL << CAN_MSR_SAMP_Pos)                  
#define CAN_MSR_SAMP           CAN_MSR_SAMP_Msk                             
#define CAN_MSR_RX_Pos         (11U)                                        
#define CAN_MSR_RX_Msk         (0x1UL << CAN_MSR_RX_Pos)                    
#define CAN_MSR_RX             CAN_MSR_RX_Msk                               

/*******************  Bit definition for CAN_TSR register  ********************/
#define CAN_TSR_RQCP0_Pos      (0U)                                            
#define CAN_TSR_RQCP0_Msk      (0x1UL << CAN_TSR_RQCP0_Pos)                
#define CAN_TSR_RQCP0          CAN_TSR_RQCP0_Msk                           
#define CAN_TSR_TXOK0_Pos      (1U)                                        
#define CAN_TSR_TXOK0_Msk      (0x1UL << CAN_TSR_TXOK0_Pos)                
#define CAN_TSR_TXOK0          CAN_TSR_TXOK0_Msk                           
#define CAN_TSR_ALST0_Pos      (2U)                                        
#define CAN_TSR_ALST0_Msk      (0x1UL << CAN_TSR_ALST0_Pos)                
#define CAN_TSR_ALST0          CAN_TSR_ALST0_Msk                           
#define CAN_TSR_TERR0_Pos      (3U)                                        
#define CAN_TSR_TERR0_Msk      (0x1UL << CAN_TSR_TERR0_Pos)                
#define CAN_TSR_TERR0          CAN_TSR_TERR0_Msk                           
#define CAN_TSR_ABRQ0_Pos      (7U)                                        
#define CAN_TSR_ABRQ0_Msk      (0x1UL << CAN_TSR_ABRQ0_Pos)                
#define CAN_TSR_ABRQ0          CAN_TSR_ABRQ0_Msk                           
#define CAN_TSR_RQCP1_Pos      (8U)                                        
#define CAN_TSR_RQCP1_Msk      (0x1UL << CAN_TSR_RQCP1_Pos)                
#define CAN_TSR_RQCP1          CAN_TSR_RQCP1_Msk                           
#define CAN_TSR_TXOK1_Pos      (9U)                                        
#define CAN_TSR_TXOK1_Msk      (0x1UL << CAN_TSR_TXOK1_Pos)                
#define CAN_TSR_TXOK1          CAN_TSR_TXOK1_Msk                           
#define CAN_TSR_ALST1_Pos      (10U)                                       
#define CAN_TSR_ALST1_Msk      (0x1UL << CAN_TSR_ALST1_Pos)                
#define CAN_TSR_ALST1          CAN_TSR_ALST1_Msk                           
#define CAN_TSR_TERR1_Pos      (11U)                                       
#define CAN_TSR_TERR1_Msk      (0x1UL << CAN_TSR_TERR1_Pos)                
#define CAN_TSR_TERR1          CAN_TSR_TERR1_Msk                           
#define CAN_TSR_ABRQ1_Pos      (15U)                                       
#define CAN_TSR_ABRQ1_Msk      (0x1UL << CAN_TSR_ABRQ1_Pos)                
#define CAN_TSR_ABRQ1          CAN_TSR_ABRQ1_Msk                           
#define CAN_TSR_RQCP2_Pos      (16U)                                       
#define CAN_TSR_RQCP2_Msk      (0x1UL << CAN_TSR_RQCP2_Pos)                
#define CAN_TSR_RQCP2          CAN_TSR_RQCP2_Msk                           
#define CAN_TSR_TXOK2_Pos      (17U)                                       
#define CAN_TSR_TXOK2_Msk      (0x1UL << CAN_TSR_TXOK2_Pos)                
#define CAN_TSR_TXOK2          CAN_TSR_TXOK2_Msk                           
#define CAN_TSR_ALST2_Pos      (18U)                                       
#define CAN_TSR_ALST2_Msk      (0x1UL << CAN_TSR_ALST2_Pos)                
#define CAN_TSR_ALST2          CAN_TSR_ALST2_Msk                           
#define CAN_TSR_TERR2_Pos      (19U)                                       
#define CAN_TSR_TERR2_Msk      (0x1UL << CAN_TSR_TERR2_Pos)                
#define CAN_TSR_TERR2          CAN_TSR_TERR2_Msk                           
#define CAN_TSR_ABRQ2_Pos      (23U)                                       
#define CAN_TSR_ABRQ2_Msk      (0x1UL << CAN_TSR_ABRQ2_Pos)                
#define CAN_TSR_ABRQ2          CAN_TSR_ABRQ2_Msk                           
#define CAN_TSR_CODE_Pos       (24U)                                       
#define CAN_TSR_CODE_Msk       (0x3UL << CAN_TSR_CODE_Pos)                 
#define CAN_TSR_CODE           CAN_TSR_CODE_Msk                            

