sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
#define CAN_TSR_TME_Pos        (26U)                                       
#define CAN_TSR_TME_Msk        (0x7UL << CAN_TSR_TME_Pos)                  
#define CAN_TSR_TME            CAN_TSR_TME_Msk                             
#define CAN_TSR_TME0_Pos       (26U)                                       
#define CAN_TSR_TME0_Msk       (0x1UL << CAN_TSR_TME0_Pos)                 
#define CAN_TSR_TME0           CAN_TSR_TME0_Msk                            
#define CAN_TSR_TME1_Pos       (27U)                                       
#define CAN_TSR_TME1_Msk       (0x1UL << CAN_TSR_TME1_Pos)                 
#define CAN_TSR_TME1           CAN_TSR_TME1_Msk                            
#define CAN_TSR_TME2_Pos       (28U)                                       
#define CAN_TSR_TME2_Msk       (0x1UL << CAN_TSR_TME2_Pos)                 
#define CAN_TSR_TME2           CAN_TSR_TME2_Msk                            

#define CAN_TSR_LOW_Pos        (29U)                                       
#define CAN_TSR_LOW_Msk        (0x7UL << CAN_TSR_LOW_Pos)                  
#define CAN_TSR_LOW            CAN_TSR_LOW_Msk                             
#define CAN_TSR_LOW0_Pos       (29U)                                       
#define CAN_TSR_LOW0_Msk       (0x1UL << CAN_TSR_LOW0_Pos)                 
#define CAN_TSR_LOW0           CAN_TSR_LOW0_Msk                            
#define CAN_TSR_LOW1_Pos       (30U)                                       
#define CAN_TSR_LOW1_Msk       (0x1UL << CAN_TSR_LOW1_Pos)                 
#define CAN_TSR_LOW1           CAN_TSR_LOW1_Msk                            
#define CAN_TSR_LOW2_Pos       (31U)                                       
#define CAN_TSR_LOW2_Msk       (0x1UL << CAN_TSR_LOW2_Pos)                 
#define CAN_TSR_LOW2           CAN_TSR_LOW2_Msk                            

/*******************  Bit definition for CAN_RF0R register  *******************/
#define CAN_RF0R_FMP0_Pos      (0U)                                        
#define CAN_RF0R_FMP0_Msk      (0x3UL << CAN_RF0R_FMP0_Pos)                
#define CAN_RF0R_FMP0          CAN_RF0R_FMP0_Msk                           
#define CAN_RF0R_FULL0_Pos     (3U)                                        
#define CAN_RF0R_FULL0_Msk     (0x1UL << CAN_RF0R_FULL0_Pos)               
#define CAN_RF0R_FULL0         CAN_RF0R_FULL0_Msk                          
#define CAN_RF0R_FOVR0_Pos     (4U)                                        
#define CAN_RF0R_FOVR0_Msk     (0x1UL << CAN_RF0R_FOVR0_Pos)               
#define CAN_RF0R_FOVR0         CAN_RF0R_FOVR0_Msk                          
#define CAN_RF0R_RFOM0_Pos     (5U)                                        
#define CAN_RF0R_RFOM0_Msk     (0x1UL << CAN_RF0R_RFOM0_Pos)               
#define CAN_RF0R_RFOM0         CAN_RF0R_RFOM0_Msk                          

/*******************  Bit definition for CAN_RF1R register  *******************/
#define CAN_RF1R_FMP1_Pos      (0U)                                           
#define CAN_RF1R_FMP1_Msk      (0x3UL << CAN_RF1R_FMP1_Pos)                   
#define CAN_RF1R_FMP1          CAN_RF1R_FMP1_Msk                              
#define CAN_RF1R_FULL1_Pos     (3U)                                           
#define CAN_RF1R_FULL1_Msk     (0x1UL << CAN_RF1R_FULL1_Pos)                  
#define CAN_RF1R_FULL1         CAN_RF1R_FULL1_Msk                             
#define CAN_RF1R_FOVR1_Pos     (4U)                                           
#define CAN_RF1R_FOVR1_Msk     (0x1UL << CAN_RF1R_FOVR1_Pos)                  
#define CAN_RF1R_FOVR1         CAN_RF1R_FOVR1_Msk                             
#define CAN_RF1R_RFOM1_Pos     (5U)                                           
#define CAN_RF1R_RFOM1_Msk     (0x1UL << CAN_RF1R_RFOM1_Pos)                  
#define CAN_RF1R_RFOM1         CAN_RF1R_RFOM1_Msk                             

/********************  Bit definition for CAN_IER register  *******************/
#define CAN_IER_TMEIE_Pos      (0U)                                            
#define CAN_IER_TMEIE_Msk      (0x1UL << CAN_IER_TMEIE_Pos)                     
#define CAN_IER_TMEIE          CAN_IER_TMEIE_Msk                           
#define CAN_IER_FMPIE0_Pos     (1U)                                        
#define CAN_IER_FMPIE0_Msk     (0x1UL << CAN_IER_FMPIE0_Pos)               
#define CAN_IER_FMPIE0         CAN_IER_FMPIE0_Msk                          
#define CAN_IER_FFIE0_Pos      (2U)                                        
#define CAN_IER_FFIE0_Msk      (0x1UL << CAN_IER_FFIE0_Pos)                
#define CAN_IER_FFIE0          CAN_IER_FFIE0_Msk                           
#define CAN_IER_FOVIE0_Pos     (3U)                                        
#define CAN_IER_FOVIE0_Msk     (0x1UL << CAN_IER_FOVIE0_Pos)               
#define CAN_IER_FOVIE0         CAN_IER_FOVIE0_Msk                          
#define CAN_IER_FMPIE1_Pos     (4U)                                        
#define CAN_IER_FMPIE1_Msk     (0x1UL << CAN_IER_FMPIE1_Pos)               
#define CAN_IER_FMPIE1         CAN_IER_FMPIE1_Msk                          
#define CAN_IER_FFIE1_Pos      (5U)                                        
#define CAN_IER_FFIE1_Msk      (0x1UL << CAN_IER_FFIE1_Pos)                
#define CAN_IER_FFIE1          CAN_IER_FFIE1_Msk                           
#define CAN_IER_FOVIE1_Pos     (6U)                                        
#define CAN_IER_FOVIE1_Msk     (0x1UL << CAN_IER_FOVIE1_Pos)               
#define CAN_IER_FOVIE1         CAN_IER_FOVIE1_Msk                          
#define CAN_IER_EWGIE_Pos      (8U)                                        
#define CAN_IER_EWGIE_Msk      (0x1UL << CAN_IER_EWGIE_Pos)                
#define CAN_IER_EWGIE          CAN_IER_EWGIE_Msk                           
#define CAN_IER_EPVIE_Pos      (9U)                                        
#define CAN_IER_EPVIE_Msk      (0x1UL << CAN_IER_EPVIE_Pos)                
#define CAN_IER_EPVIE          CAN_IER_EPVIE_Msk                           
#define CAN_IER_BOFIE_Pos      (10U)                                       
#define CAN_IER_BOFIE_Msk      (0x1UL << CAN_IER_BOFIE_Pos)                
#define CAN_IER_BOFIE          CAN_IER_BOFIE_Msk                           
#define CAN_IER_LECIE_Pos      (11U)                                       
#define CAN_IER_LECIE_Msk      (0x1UL << CAN_IER_LECIE_Pos)                
#define CAN_IER_LECIE          CAN_IER_LECIE_Msk                           
#define CAN_IER_ERRIE_Pos      (15U)                                       
#define CAN_IER_ERRIE_Msk      (0x1UL << CAN_IER_ERRIE_Pos)                
#define CAN_IER_ERRIE          CAN_IER_ERRIE_Msk                           
#define CAN_IER_WKUIE_Pos      (16U)                                       
#define CAN_IER_WKUIE_Msk      (0x1UL << CAN_IER_WKUIE_Pos)                
#define CAN_IER_WKUIE          CAN_IER_WKUIE_Msk                           
#define CAN_IER_SLKIE_Pos      (17U)                                       
#define CAN_IER_SLKIE_Msk      (0x1UL << CAN_IER_SLKIE_Pos)                
#define CAN_IER_SLKIE          CAN_IER_SLKIE_Msk                           
#define CAN_IER_EWGIE_Pos      (8U)                                            

/********************  Bit definition for CAN_ESR register  *******************/
#define CAN_ESR_EWGF_Pos       (0U)                                            
#define CAN_ESR_EWGF_Msk       (0x1UL << CAN_ESR_EWGF_Pos)                  
#define CAN_ESR_EWGF           CAN_ESR_EWGF_Msk                             
#define CAN_ESR_EPVF_Pos       (1U)                                         
#define CAN_ESR_EPVF_Msk       (0x1UL << CAN_ESR_EPVF_Pos)                  
#define CAN_ESR_EPVF           CAN_ESR_EPVF_Msk                             
#define CAN_ESR_BOFF_Pos       (2U)                                         
#define CAN_ESR_BOFF_Msk       (0x1UL << CAN_ESR_BOFF_Pos)                  
#define CAN_ESR_BOFF           CAN_ESR_BOFF_Msk                             

#define CAN_ESR_LEC_Pos        (4U)                                         
#define CAN_ESR_LEC_Msk        (0x7UL << CAN_ESR_LEC_Pos)                   
#define CAN_ESR_LEC            CAN_ESR_LEC_Msk                              
#define CAN_ESR_LEC_0          (0x1UL << CAN_ESR_LEC_Pos)                   
#define CAN_ESR_LEC_1          (0x2UL << CAN_ESR_LEC_Pos)                   
#define CAN_ESR_LEC_2          (0x4UL << CAN_ESR_LEC_Pos)                   

