sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
#define CAN_ESR_TEC_Pos        (16U)                                        
#define CAN_ESR_TEC_Msk        (0xFFUL << CAN_ESR_TEC_Pos)                  
#define CAN_ESR_TEC            CAN_ESR_TEC_Msk                              
#define CAN_ESR_REC_Pos        (24U)                                        
#define CAN_ESR_REC_Msk        (0xFFUL << CAN_ESR_REC_Pos)                  
#define CAN_ESR_REC            CAN_ESR_REC_Msk                              

/*******************  Bit definition for CAN_BTR register  ********************/
#define CAN_BTR_BRP_Pos        (0U)                                            
#define CAN_BTR_BRP_Msk        (0x3FFUL << CAN_BTR_BRP_Pos)                 
#define CAN_BTR_BRP            CAN_BTR_BRP_Msk                              
#define CAN_BTR_TS1_Pos        (16U)                                        
#define CAN_BTR_TS1_Msk        (0xFUL << CAN_BTR_TS1_Pos)                   
#define CAN_BTR_TS1            CAN_BTR_TS1_Msk                              
#define CAN_BTR_TS1_0          (0x1UL << CAN_BTR_TS1_Pos)                   
#define CAN_BTR_TS1_1          (0x2UL << CAN_BTR_TS1_Pos)                   
#define CAN_BTR_TS1_2          (0x4UL << CAN_BTR_TS1_Pos)                   
#define CAN_BTR_TS1_3          (0x8UL << CAN_BTR_TS1_Pos)                   
#define CAN_BTR_TS2_Pos        (20U)                                        
#define CAN_BTR_TS2_Msk        (0x7UL << CAN_BTR_TS2_Pos)                   
#define CAN_BTR_TS2            CAN_BTR_TS2_Msk                              
#define CAN_BTR_TS2_0          (0x1UL << CAN_BTR_TS2_Pos)                   
#define CAN_BTR_TS2_1          (0x2UL << CAN_BTR_TS2_Pos)                   
#define CAN_BTR_TS2_2          (0x4UL << CAN_BTR_TS2_Pos)                   
#define CAN_BTR_SJW_Pos        (24U)                                        
#define CAN_BTR_SJW_Msk        (0x3UL << CAN_BTR_SJW_Pos)                   
#define CAN_BTR_SJW            CAN_BTR_SJW_Msk                              
#define CAN_BTR_SJW_0          (0x1UL << CAN_BTR_SJW_Pos)                   
#define CAN_BTR_SJW_1          (0x2UL << CAN_BTR_SJW_Pos)                   
#define CAN_BTR_LBKM_Pos       (30U)                                        
#define CAN_BTR_LBKM_Msk       (0x1UL << CAN_BTR_LBKM_Pos)                  
#define CAN_BTR_LBKM           CAN_BTR_LBKM_Msk                             
#define CAN_BTR_SILM_Pos       (31U)                                        
#define CAN_BTR_SILM_Msk       (0x1UL << CAN_BTR_SILM_Pos)                  
#define CAN_BTR_SILM           CAN_BTR_SILM_Msk                             


/*Mailbox registers */
/******************  Bit definition for CAN_TI0R register  ********************/
#define CAN_TI0R_TXRQ_Pos      (0U)                                            
#define CAN_TI0R_TXRQ_Msk      (0x1UL << CAN_TI0R_TXRQ_Pos)               
#define CAN_TI0R_TXRQ          CAN_TI0R_TXRQ_Msk                          
#define CAN_TI0R_RTR_Pos       (1U)                                       
#define CAN_TI0R_RTR_Msk       (0x1UL << CAN_TI0R_RTR_Pos)                
#define CAN_TI0R_RTR           CAN_TI0R_RTR_Msk                           
#define CAN_TI0R_IDE_Pos       (2U)                                       
#define CAN_TI0R_IDE_Msk       (0x1UL << CAN_TI0R_IDE_Pos)                
#define CAN_TI0R_IDE           CAN_TI0R_IDE_Msk                           
#define CAN_TI0R_EXID_Pos      (3U)                                       
#define CAN_TI0R_EXID_Msk      (0x3FFFFUL << CAN_TI0R_EXID_Pos)           
#define CAN_TI0R_EXID          CAN_TI0R_EXID_Msk                          
#define CAN_TI0R_STID_Pos      (21U)                                      
#define CAN_TI0R_STID_Msk      (0x7FFUL << CAN_TI0R_STID_Pos)             
#define CAN_TI0R_STID          CAN_TI0R_STID_Msk                          

/******************  Bit definition for CAN_TDT0R register  *******************/
#define CAN_TDT0R_DLC_Pos      (0U)                                         
#define CAN_TDT0R_DLC_Msk      (0xFUL << CAN_TDT0R_DLC_Pos)                 
#define CAN_TDT0R_DLC          CAN_TDT0R_DLC_Msk                            
#define CAN_TDT0R_TGT_Pos      (8U)                                         
#define CAN_TDT0R_TGT_Msk      (0x1UL << CAN_TDT0R_TGT_Pos)                 
#define CAN_TDT0R_TGT          CAN_TDT0R_TGT_Msk                            
#define CAN_TDT0R_TIME_Pos     (16U)                                        
#define CAN_TDT0R_TIME_Msk     (0xFFFFUL << CAN_TDT0R_TIME_Pos)             
#define CAN_TDT0R_TIME         CAN_TDT0R_TIME_Msk                           

/******************  Bit definition for CAN_TDL0R register  *******************/
#define CAN_TDL0R_DATA0_Pos    (0U)                                            
#define CAN_TDL0R_DATA0_Msk    (0xFFUL << CAN_TDL0R_DATA0_Pos)            
#define CAN_TDL0R_DATA0        CAN_TDL0R_DATA0_Msk                        
#define CAN_TDL0R_DATA1_Pos    (8U)                                       
#define CAN_TDL0R_DATA1_Msk    (0xFFUL << CAN_TDL0R_DATA1_Pos)            
#define CAN_TDL0R_DATA1        CAN_TDL0R_DATA1_Msk                        
#define CAN_TDL0R_DATA2_Pos    (16U)                                      
#define CAN_TDL0R_DATA2_Msk    (0xFFUL << CAN_TDL0R_DATA2_Pos)            
#define CAN_TDL0R_DATA2        CAN_TDL0R_DATA2_Msk                        
#define CAN_TDL0R_DATA3_Pos    (24U)                                      
#define CAN_TDL0R_DATA3_Msk    (0xFFUL << CAN_TDL0R_DATA3_Pos)            
#define CAN_TDL0R_DATA3        CAN_TDL0R_DATA3_Msk                        

/******************  Bit definition for CAN_TDH0R register  *******************/
#define CAN_TDH0R_DATA4_Pos    (0U)                                         
#define CAN_TDH0R_DATA4_Msk    (0xFFUL << CAN_TDH0R_DATA4_Pos)              
#define CAN_TDH0R_DATA4        CAN_TDH0R_DATA4_Msk                          
#define CAN_TDH0R_DATA5_Pos    (8U)                                         
#define CAN_TDH0R_DATA5_Msk    (0xFFUL << CAN_TDH0R_DATA5_Pos)              
#define CAN_TDH0R_DATA5        CAN_TDH0R_DATA5_Msk                          
#define CAN_TDH0R_DATA6_Pos    (16U)                                        
#define CAN_TDH0R_DATA6_Msk    (0xFFUL << CAN_TDH0R_DATA6_Pos)              
#define CAN_TDH0R_DATA6        CAN_TDH0R_DATA6_Msk                          
#define CAN_TDH0R_DATA7_Pos    (24U)                                        
#define CAN_TDH0R_DATA7_Msk    (0xFFUL << CAN_TDH0R_DATA7_Pos)              
#define CAN_TDH0R_DATA7        CAN_TDH0R_DATA7_Msk                          

/*******************  Bit definition for CAN_TI1R register  *******************/
#define CAN_TI1R_TXRQ_Pos      (0U)                                            
#define CAN_TI1R_TXRQ_Msk      (0x1UL << CAN_TI1R_TXRQ_Pos)                  
#define CAN_TI1R_TXRQ          CAN_TI1R_TXRQ_Msk                             
#define CAN_TI1R_RTR_Pos       (1U)                                          
#define CAN_TI1R_RTR_Msk       (0x1UL << CAN_TI1R_RTR_Pos)                   
#define CAN_TI1R_RTR           CAN_TI1R_RTR_Msk                              
#define CAN_TI1R_IDE_Pos       (2U)                                          
#define CAN_TI1R_IDE_Msk       (0x1UL << CAN_TI1R_IDE_Pos)                   
#define CAN_TI1R_IDE           CAN_TI1R_IDE_Msk                              
#define CAN_TI1R_EXID_Pos      (3U)                                          
#define CAN_TI1R_EXID_Msk      (0x3FFFFUL << CAN_TI1R_EXID_Pos)              
#define CAN_TI1R_EXID          CAN_TI1R_EXID_Msk                             
#define CAN_TI1R_STID_Pos      (21U)                                         
#define CAN_TI1R_STID_Msk      (0x7FFUL << CAN_TI1R_STID_Pos)                
#define CAN_TI1R_STID          CAN_TI1R_STID_Msk                             

/*******************  Bit definition for CAN_TDT1R register  ******************/
#define CAN_TDT1R_DLC_Pos      (0U)                                            
#define CAN_TDT1R_DLC_Msk      (0xFUL << CAN_TDT1R_DLC_Pos)                  
#define CAN_TDT1R_DLC          CAN_TDT1R_DLC_Msk                             
#define CAN_TDT1R_TGT_Pos      (8U)                                          
#define CAN_TDT1R_TGT_Msk      (0x1UL << CAN_TDT1R_TGT_Pos)                  
#define CAN_TDT1R_TGT          CAN_TDT1R_TGT_Msk                             
#define CAN_TDT1R_TIME_Pos     (16U)                                         
#define CAN_TDT1R_TIME_Msk     (0xFFFFUL << CAN_TDT1R_TIME_Pos)              
#define CAN_TDT1R_TIME         CAN_TDT1R_TIME_Msk                            

/*******************  Bit definition for CAN_TDL1R register  ******************/
#define CAN_TDL1R_DATA0_Pos    (0U)                                            
#define CAN_TDL1R_DATA0_Msk    (0xFFUL << CAN_TDL1R_DATA0_Pos)                
#define CAN_TDL1R_DATA0        CAN_TDL1R_DATA0_Msk                            
#define CAN_TDL1R_DATA1_Pos    (8U)                                           
#define CAN_TDL1R_DATA1_Msk    (0xFFUL << CAN_TDL1R_DATA1_Pos)                
#define CAN_TDL1R_DATA1        CAN_TDL1R_DATA1_Msk                            
#define CAN_TDL1R_DATA2_Pos    (16U)                                          
#define CAN_TDL1R_DATA2_Msk    (0xFFUL << CAN_TDL1R_DATA2_Pos)                
#define CAN_TDL1R_DATA2        CAN_TDL1R_DATA2_Msk                            
#define CAN_TDL1R_DATA3_Pos    (24U)                                          
#define CAN_TDL1R_DATA3_Msk    (0xFFUL << CAN_TDL1R_DATA3_Pos)                
#define CAN_TDL1R_DATA3        CAN_TDL1R_DATA3_Msk                            

/*******************  Bit definition for CAN_TDH1R register  ******************/
#define CAN_TDH1R_DATA4_Pos    (0U)                                            
#define CAN_TDH1R_DATA4_Msk    (0xFFUL << CAN_TDH1R_DATA4_Pos)               
#define CAN_TDH1R_DATA4        CAN_TDH1R_DATA4_Msk                           
#define CAN_TDH1R_DATA5_Pos    (8U)                                          
#define CAN_TDH1R_DATA5_Msk    (0xFFUL << CAN_TDH1R_DATA5_Pos)               
#define CAN_TDH1R_DATA5        CAN_TDH1R_DATA5_Msk                           
#define CAN_TDH1R_DATA6_Pos    (16U)                                         
#define CAN_TDH1R_DATA6_Msk    (0xFFUL << CAN_TDH1R_DATA6_Pos)               
#define CAN_TDH1R_DATA6        CAN_TDH1R_DATA6_Msk                           
#define CAN_TDH1R_DATA7_Pos    (24U)                                         
#define CAN_TDH1R_DATA7_Msk    (0xFFUL << CAN_TDH1R_DATA7_Pos)               
#define CAN_TDH1R_DATA7        CAN_TDH1R_DATA7_Msk                           

/*******************  Bit definition for CAN_TI2R register  *******************/
#define CAN_TI2R_TXRQ_Pos      (0U)                                            
#define CAN_TI2R_TXRQ_Msk      (0x1UL << CAN_TI2R_TXRQ_Pos)                 
#define CAN_TI2R_TXRQ          CAN_TI2R_TXRQ_Msk                            
#define CAN_TI2R_RTR_Pos       (1U)                                         
#define CAN_TI2R_RTR_Msk       (0x1UL << CAN_TI2R_RTR_Pos)                  
#define CAN_TI2R_RTR           CAN_TI2R_RTR_Msk                             
#define CAN_TI2R_IDE_Pos       (2U)                                         
#define CAN_TI2R_IDE_Msk       (0x1UL << CAN_TI2R_IDE_Pos)                  
#define CAN_TI2R_IDE           CAN_TI2R_IDE_Msk                             
#define CAN_TI2R_EXID_Pos      (3U)                                         
#define CAN_TI2R_EXID_Msk      (0x3FFFFUL << CAN_TI2R_EXID_Pos)             
#define CAN_TI2R_EXID          CAN_TI2R_EXID_Msk                            
#define CAN_TI2R_STID_Pos      (21U)                                        
#define CAN_TI2R_STID_Msk      (0x7FFUL << CAN_TI2R_STID_Pos)               
#define CAN_TI2R_STID          CAN_TI2R_STID_Msk                            

/*******************  Bit definition for CAN_TDT2R register  ******************/  
#define CAN_TDT2R_DLC_Pos      (0U)                                            
#define CAN_TDT2R_DLC_Msk      (0xFUL << CAN_TDT2R_DLC_Pos)                  
#define CAN_TDT2R_DLC          CAN_TDT2R_DLC_Msk                             
#define CAN_TDT2R_TGT_Pos      (8U)                                          
#define CAN_TDT2R_TGT_Msk      (0x1UL << CAN_TDT2R_TGT_Pos)                  
#define CAN_TDT2R_TGT          CAN_TDT2R_TGT_Msk                             
#define CAN_TDT2R_TIME_Pos     (16U)                                         
#define CAN_TDT2R_TIME_Msk     (0xFFFFUL << CAN_TDT2R_TIME_Pos)              
#define CAN_TDT2R_TIME         CAN_TDT2R_TIME_Msk                            

/*******************  Bit definition for CAN_TDL2R register  ******************/
#define CAN_TDL2R_DATA0_Pos    (0U)                                            
#define CAN_TDL2R_DATA0_Msk    (0xFFUL << CAN_TDL2R_DATA0_Pos)              
#define CAN_TDL2R_DATA0        CAN_TDL2R_DATA0_Msk                          
#define CAN_TDL2R_DATA1_Pos    (8U)                                         
#define CAN_TDL2R_DATA1_Msk    (0xFFUL << CAN_TDL2R_DATA1_Pos)              
#define CAN_TDL2R_DATA1        CAN_TDL2R_DATA1_Msk                          
#define CAN_TDL2R_DATA2_Pos    (16U)                                        
#define CAN_TDL2R_DATA2_Msk    (0xFFUL << CAN_TDL2R_DATA2_Pos)              
#define CAN_TDL2R_DATA2        CAN_TDL2R_DATA2_Msk                          
#define CAN_TDL2R_DATA3_Pos    (24U)                                        
#define CAN_TDL2R_DATA3_Msk    (0xFFUL << CAN_TDL2R_DATA3_Pos)              
#define CAN_TDL2R_DATA3        CAN_TDL2R_DATA3_Msk                          

/*******************  Bit definition for CAN_TDH2R register  ******************/
#define CAN_TDH2R_DATA4_Pos    (0U)                                            
#define CAN_TDH2R_DATA4_Msk    (0xFFUL << CAN_TDH2R_DATA4_Pos)                
#define CAN_TDH2R_DATA4        CAN_TDH2R_DATA4_Msk                            
#define CAN_TDH2R_DATA5_Pos    (8U)                                           
#define CAN_TDH2R_DATA5_Msk    (0xFFUL << CAN_TDH2R_DATA5_Pos)                
#define CAN_TDH2R_DATA5        CAN_TDH2R_DATA5_Msk                            
#define CAN_TDH2R_DATA6_Pos    (16U)                                          
#define CAN_TDH2R_DATA6_Msk    (0xFFUL << CAN_TDH2R_DATA6_Pos)                
#define CAN_TDH2R_DATA6        CAN_TDH2R_DATA6_Msk                            
#define CAN_TDH2R_DATA7_Pos    (24U)                                          
#define CAN_TDH2R_DATA7_Msk    (0xFFUL << CAN_TDH2R_DATA7_Pos)                
#define CAN_TDH2R_DATA7        CAN_TDH2R_DATA7_Msk                            

/*******************  Bit definition for CAN_RI0R register  *******************/
#define CAN_RI0R_RTR_Pos       (1U)                                            
#define CAN_RI0R_RTR_Msk       (0x1UL << CAN_RI0R_RTR_Pos)                      
#define CAN_RI0R_RTR           CAN_RI0R_RTR_Msk                              
#define CAN_RI0R_IDE_Pos       (2U)                                          
#define CAN_RI0R_IDE_Msk       (0x1UL << CAN_RI0R_IDE_Pos)                   
#define CAN_RI0R_IDE           CAN_RI0R_IDE_Msk                              
#define CAN_RI0R_EXID_Pos      (3U)                                          
#define CAN_RI0R_EXID_Msk      (0x3FFFFUL << CAN_RI0R_EXID_Pos)              
#define CAN_RI0R_EXID          CAN_RI0R_EXID_Msk                             
#define CAN_RI0R_STID_Pos      (21U)                                         
#define CAN_RI0R_STID_Msk      (0x7FFUL << CAN_RI0R_STID_Pos)                
#define CAN_RI0R_STID          CAN_RI0R_STID_Msk                             

/*******************  Bit definition for CAN_RDT0R register  ******************/
#define CAN_RDT0R_DLC_Pos      (0U)                                            
#define CAN_RDT0R_DLC_Msk      (0xFUL << CAN_RDT0R_DLC_Pos)                  
#define CAN_RDT0R_DLC          CAN_RDT0R_DLC_Msk                             
#define CAN_RDT0R_FMI_Pos      (8U)                                          
#define CAN_RDT0R_FMI_Msk      (0xFFUL << CAN_RDT0R_FMI_Pos)                 
#define CAN_RDT0R_FMI          CAN_RDT0R_FMI_Msk                             
#define CAN_RDT0R_TIME_Pos     (16U)                                         
#define CAN_RDT0R_TIME_Msk     (0xFFFFUL << CAN_RDT0R_TIME_Pos)              
#define CAN_RDT0R_TIME         CAN_RDT0R_TIME_Msk                            

