sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
/*******************  Bit definition for CAN_RDL0R register  ******************/
#define CAN_RDL0R_DATA0_Pos    (0U)                                            
#define CAN_RDL0R_DATA0_Msk    (0xFFUL << CAN_RDL0R_DATA0_Pos)             
#define CAN_RDL0R_DATA0        CAN_RDL0R_DATA0_Msk                         
#define CAN_RDL0R_DATA1_Pos    (8U)                                        
#define CAN_RDL0R_DATA1_Msk    (0xFFUL << CAN_RDL0R_DATA1_Pos)             
#define CAN_RDL0R_DATA1        CAN_RDL0R_DATA1_Msk                         
#define CAN_RDL0R_DATA2_Pos    (16U)                                       
#define CAN_RDL0R_DATA2_Msk    (0xFFUL << CAN_RDL0R_DATA2_Pos)             
#define CAN_RDL0R_DATA2        CAN_RDL0R_DATA2_Msk                         
#define CAN_RDL0R_DATA3_Pos    (24U)                                       
#define CAN_RDL0R_DATA3_Msk    (0xFFUL << CAN_RDL0R_DATA3_Pos)             
#define CAN_RDL0R_DATA3        CAN_RDL0R_DATA3_Msk                         

/*******************  Bit definition for CAN_RDH0R register  ******************/
#define CAN_RDH0R_DATA4_Pos    (0U)                                            
#define CAN_RDH0R_DATA4_Msk    (0xFFUL << CAN_RDH0R_DATA4_Pos)               
#define CAN_RDH0R_DATA4        CAN_RDH0R_DATA4_Msk                           
#define CAN_RDH0R_DATA5_Pos    (8U)                                          
#define CAN_RDH0R_DATA5_Msk    (0xFFUL << CAN_RDH0R_DATA5_Pos)               
#define CAN_RDH0R_DATA5        CAN_RDH0R_DATA5_Msk                           
#define CAN_RDH0R_DATA6_Pos    (16U)                                         
#define CAN_RDH0R_DATA6_Msk    (0xFFUL << CAN_RDH0R_DATA6_Pos)               
#define CAN_RDH0R_DATA6        CAN_RDH0R_DATA6_Msk                           
#define CAN_RDH0R_DATA7_Pos    (24U)                                         
#define CAN_RDH0R_DATA7_Msk    (0xFFUL << CAN_RDH0R_DATA7_Pos)               
#define CAN_RDH0R_DATA7        CAN_RDH0R_DATA7_Msk                           

/*******************  Bit definition for CAN_RI1R register  *******************/
#define CAN_RI1R_RTR_Pos       (1U)                                            
#define CAN_RI1R_RTR_Msk       (0x1UL << CAN_RI1R_RTR_Pos)                      
#define CAN_RI1R_RTR           CAN_RI1R_RTR_Msk                              
#define CAN_RI1R_IDE_Pos       (2U)                                          
#define CAN_RI1R_IDE_Msk       (0x1UL << CAN_RI1R_IDE_Pos)                   
#define CAN_RI1R_IDE           CAN_RI1R_IDE_Msk                              
#define CAN_RI1R_EXID_Pos      (3U)                                          
#define CAN_RI1R_EXID_Msk      (0x3FFFFUL << CAN_RI1R_EXID_Pos)              
#define CAN_RI1R_EXID          CAN_RI1R_EXID_Msk                             
#define CAN_RI1R_STID_Pos      (21U)                                         
#define CAN_RI1R_STID_Msk      (0x7FFUL << CAN_RI1R_STID_Pos)                
#define CAN_RI1R_STID          CAN_RI1R_STID_Msk                             

/*******************  Bit definition for CAN_RDT1R register  ******************/
#define CAN_RDT1R_DLC_Pos      (0U)                                         
#define CAN_RDT1R_DLC_Msk      (0xFUL << CAN_RDT1R_DLC_Pos)                 
#define CAN_RDT1R_DLC          CAN_RDT1R_DLC_Msk                            
#define CAN_RDT1R_FMI_Pos      (8U)                                         
#define CAN_RDT1R_FMI_Msk      (0xFFUL << CAN_RDT1R_FMI_Pos)                
#define CAN_RDT1R_FMI          CAN_RDT1R_FMI_Msk                            
#define CAN_RDT1R_TIME_Pos     (16U)                                        
#define CAN_RDT1R_TIME_Msk     (0xFFFFUL << CAN_RDT1R_TIME_Pos)             
#define CAN_RDT1R_TIME         CAN_RDT1R_TIME_Msk                           

/*******************  Bit definition for CAN_RDL1R register  ******************/
#define CAN_RDL1R_DATA0_Pos    (0U)                                            
#define CAN_RDL1R_DATA0_Msk    (0xFFUL << CAN_RDL1R_DATA0_Pos)                 
#define CAN_RDL1R_DATA0        CAN_RDL1R_DATA0_Msk                             
#define CAN_RDL1R_DATA1_Pos    (8U)                                           
#define CAN_RDL1R_DATA1_Msk    (0xFFUL << CAN_RDL1R_DATA1_Pos)                 
#define CAN_RDL1R_DATA1        CAN_RDL1R_DATA1_Msk                             
#define CAN_RDL1R_DATA2_Pos    (16U)                                          
#define CAN_RDL1R_DATA2_Msk    (0xFFUL << CAN_RDL1R_DATA2_Pos)                 
#define CAN_RDL1R_DATA2        CAN_RDL1R_DATA2_Msk                             
#define CAN_RDL1R_DATA3_Pos    (24U)                                          
#define CAN_RDL1R_DATA3_Msk    (0xFFUL << CAN_RDL1R_DATA3_Pos)                 
#define CAN_RDL1R_DATA3        CAN_RDL1R_DATA3_Msk                             

/*******************  Bit definition for CAN_RDH1R register  ******************/
#define CAN_RDH1R_DATA4_Pos    (0U)                                            
#define CAN_RDH1R_DATA4_Msk    (0xFFUL << CAN_RDH1R_DATA4_Pos)                
#define CAN_RDH1R_DATA4        CAN_RDH1R_DATA4_Msk                            
#define CAN_RDH1R_DATA5_Pos    (8U)                                          
#define CAN_RDH1R_DATA5_Msk    (0xFFUL << CAN_RDH1R_DATA5_Pos)                
#define CAN_RDH1R_DATA5        CAN_RDH1R_DATA5_Msk                            
#define CAN_RDH1R_DATA6_Pos    (16U)                                         
#define CAN_RDH1R_DATA6_Msk    (0xFFUL << CAN_RDH1R_DATA6_Pos)                
#define CAN_RDH1R_DATA6        CAN_RDH1R_DATA6_Msk                            
#define CAN_RDH1R_DATA7_Pos    (24U)                                         
#define CAN_RDH1R_DATA7_Msk    (0xFFUL << CAN_RDH1R_DATA7_Pos)                
#define CAN_RDH1R_DATA7        CAN_RDH1R_DATA7_Msk                            

/*CAN filter registers */
/*******************  Bit definition for CAN_FMR register  ********************/
#define CAN_FMR_FINIT_Pos      (0U)                                            
#define CAN_FMR_FINIT_Msk      (0x1UL << CAN_FMR_FINIT_Pos)                   
#define CAN_FMR_FINIT          CAN_FMR_FINIT_Msk                              
#define CAN_FMR_CAN2SB_Pos     (8U)                                           
#define CAN_FMR_CAN2SB_Msk     (0x3FUL << CAN_FMR_CAN2SB_Pos)                 
#define CAN_FMR_CAN2SB         CAN_FMR_CAN2SB_Msk                             

