sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
/*******************  Bit definition for CAN_FM1R register  *******************/
#define CAN_FM1R_FBM_Pos       (0U)                                            
#define CAN_FM1R_FBM_Msk       (0xFFFFFFFUL << CAN_FM1R_FBM_Pos)             
#define CAN_FM1R_FBM           CAN_FM1R_FBM_Msk                              
#define CAN_FM1R_FBM0_Pos      (0U)                                          
#define CAN_FM1R_FBM0_Msk      (0x1UL << CAN_FM1R_FBM0_Pos)                  
#define CAN_FM1R_FBM0          CAN_FM1R_FBM0_Msk                             
#define CAN_FM1R_FBM1_Pos      (1U)                                          
#define CAN_FM1R_FBM1_Msk      (0x1UL << CAN_FM1R_FBM1_Pos)                  
#define CAN_FM1R_FBM1          CAN_FM1R_FBM1_Msk                             
#define CAN_FM1R_FBM2_Pos      (2U)                                          
#define CAN_FM1R_FBM2_Msk      (0x1UL << CAN_FM1R_FBM2_Pos)                  
#define CAN_FM1R_FBM2          CAN_FM1R_FBM2_Msk                             
#define CAN_FM1R_FBM3_Pos      (3U)                                          
#define CAN_FM1R_FBM3_Msk      (0x1UL << CAN_FM1R_FBM3_Pos)                  
#define CAN_FM1R_FBM3          CAN_FM1R_FBM3_Msk                             
#define CAN_FM1R_FBM4_Pos      (4U)                                          
#define CAN_FM1R_FBM4_Msk      (0x1UL << CAN_FM1R_FBM4_Pos)                  
#define CAN_FM1R_FBM4          CAN_FM1R_FBM4_Msk                             
#define CAN_FM1R_FBM5_Pos      (5U)                                          
#define CAN_FM1R_FBM5_Msk      (0x1UL << CAN_FM1R_FBM5_Pos)                  
#define CAN_FM1R_FBM5          CAN_FM1R_FBM5_Msk                             
#define CAN_FM1R_FBM6_Pos      (6U)                                          
#define CAN_FM1R_FBM6_Msk      (0x1UL << CAN_FM1R_FBM6_Pos)                  
#define CAN_FM1R_FBM6          CAN_FM1R_FBM6_Msk                             
#define CAN_FM1R_FBM7_Pos      (7U)                                          
#define CAN_FM1R_FBM7_Msk      (0x1UL << CAN_FM1R_FBM7_Pos)                  
#define CAN_FM1R_FBM7          CAN_FM1R_FBM7_Msk                             
#define CAN_FM1R_FBM8_Pos      (8U)                                          
#define CAN_FM1R_FBM8_Msk      (0x1UL << CAN_FM1R_FBM8_Pos)                  
#define CAN_FM1R_FBM8          CAN_FM1R_FBM8_Msk                             
#define CAN_FM1R_FBM9_Pos      (9U)                                          
#define CAN_FM1R_FBM9_Msk      (0x1UL << CAN_FM1R_FBM9_Pos)                  
#define CAN_FM1R_FBM9          CAN_FM1R_FBM9_Msk                             
#define CAN_FM1R_FBM10_Pos     (10U)                                         
#define CAN_FM1R_FBM10_Msk     (0x1UL << CAN_FM1R_FBM10_Pos)                 
#define CAN_FM1R_FBM10         CAN_FM1R_FBM10_Msk                            
#define CAN_FM1R_FBM11_Pos     (11U)                                         
#define CAN_FM1R_FBM11_Msk     (0x1UL << CAN_FM1R_FBM11_Pos)                 
#define CAN_FM1R_FBM11         CAN_FM1R_FBM11_Msk                            
#define CAN_FM1R_FBM12_Pos     (12U)                                         
#define CAN_FM1R_FBM12_Msk     (0x1UL << CAN_FM1R_FBM12_Pos)                
#define CAN_FM1R_FBM12         CAN_FM1R_FBM12_Msk                           
#define CAN_FM1R_FBM13_Pos     (13U)                                        
#define CAN_FM1R_FBM13_Msk     (0x1UL << CAN_FM1R_FBM13_Pos)                
#define CAN_FM1R_FBM13         CAN_FM1R_FBM13_Msk                           
#define CAN_FM1R_FBM14_Pos     (14U)                                        
#define CAN_FM1R_FBM14_Msk     (0x1UL << CAN_FM1R_FBM14_Pos)                
#define CAN_FM1R_FBM14         CAN_FM1R_FBM14_Msk                           
#define CAN_FM1R_FBM15_Pos     (15U)                                        
#define CAN_FM1R_FBM15_Msk     (0x1UL << CAN_FM1R_FBM15_Pos)                
#define CAN_FM1R_FBM15         CAN_FM1R_FBM15_Msk                           
#define CAN_FM1R_FBM16_Pos     (16U)                                        
#define CAN_FM1R_FBM16_Msk     (0x1UL << CAN_FM1R_FBM16_Pos)                
#define CAN_FM1R_FBM16         CAN_FM1R_FBM16_Msk                           
#define CAN_FM1R_FBM17_Pos     (17U)                                        
#define CAN_FM1R_FBM17_Msk     (0x1UL << CAN_FM1R_FBM17_Pos)                
#define CAN_FM1R_FBM17         CAN_FM1R_FBM17_Msk                           
#define CAN_FM1R_FBM18_Pos     (18U)                                        
#define CAN_FM1R_FBM18_Msk     (0x1UL << CAN_FM1R_FBM18_Pos)                
#define CAN_FM1R_FBM18         CAN_FM1R_FBM18_Msk                           
#define CAN_FM1R_FBM19_Pos     (19U)                                        
#define CAN_FM1R_FBM19_Msk     (0x1UL << CAN_FM1R_FBM19_Pos)                
#define CAN_FM1R_FBM19         CAN_FM1R_FBM19_Msk                           
#define CAN_FM1R_FBM20_Pos     (20U)                                        
#define CAN_FM1R_FBM20_Msk     (0x1UL << CAN_FM1R_FBM20_Pos)                
#define CAN_FM1R_FBM20         CAN_FM1R_FBM20_Msk                           
#define CAN_FM1R_FBM21_Pos     (21U)                                        
#define CAN_FM1R_FBM21_Msk     (0x1UL << CAN_FM1R_FBM21_Pos)                
#define CAN_FM1R_FBM21         CAN_FM1R_FBM21_Msk                           
#define CAN_FM1R_FBM22_Pos     (22U)                                        
#define CAN_FM1R_FBM22_Msk     (0x1UL << CAN_FM1R_FBM22_Pos)                
#define CAN_FM1R_FBM22         CAN_FM1R_FBM22_Msk                           
#define CAN_FM1R_FBM23_Pos     (23U)                                        
#define CAN_FM1R_FBM23_Msk     (0x1UL << CAN_FM1R_FBM23_Pos)                
#define CAN_FM1R_FBM23         CAN_FM1R_FBM23_Msk                          
#define CAN_FM1R_FBM24_Pos     (24U)                                       
#define CAN_FM1R_FBM24_Msk     (0x1UL << CAN_FM1R_FBM24_Pos)               
#define CAN_FM1R_FBM24         CAN_FM1R_FBM24_Msk                          
#define CAN_FM1R_FBM25_Pos     (25U)                                       
#define CAN_FM1R_FBM25_Msk     (0x1UL << CAN_FM1R_FBM25_Pos)               
#define CAN_FM1R_FBM25         CAN_FM1R_FBM25_Msk                          
#define CAN_FM1R_FBM26_Pos     (26U)                                       
#define CAN_FM1R_FBM26_Msk     (0x1UL << CAN_FM1R_FBM26_Pos)               
#define CAN_FM1R_FBM26         CAN_FM1R_FBM26_Msk                          
#define CAN_FM1R_FBM27_Pos     (27U)                                       
#define CAN_FM1R_FBM27_Msk     (0x1UL << CAN_FM1R_FBM27_Pos)               
#define CAN_FM1R_FBM27         CAN_FM1R_FBM27_Msk                          

/*******************  Bit definition for CAN_FS1R register  *******************/
#define CAN_FS1R_FSC_Pos       (0U)                                            
#define CAN_FS1R_FSC_Msk       (0xFFFFFFFUL << CAN_FS1R_FSC_Pos)         
#define CAN_FS1R_FSC           CAN_FS1R_FSC_Msk                          
#define CAN_FS1R_FSC0_Pos      (0U)                                      
#define CAN_FS1R_FSC0_Msk      (0x1UL << CAN_FS1R_FSC0_Pos)              
#define CAN_FS1R_FSC0          CAN_FS1R_FSC0_Msk                         
#define CAN_FS1R_FSC1_Pos      (1U)                                      
#define CAN_FS1R_FSC1_Msk      (0x1UL << CAN_FS1R_FSC1_Pos)              
#define CAN_FS1R_FSC1          CAN_FS1R_FSC1_Msk                         
#define CAN_FS1R_FSC2_Pos      (2U)                                      
#define CAN_FS1R_FSC2_Msk      (0x1UL << CAN_FS1R_FSC2_Pos)              
#define CAN_FS1R_FSC2          CAN_FS1R_FSC2_Msk                         
#define CAN_FS1R_FSC3_Pos      (3U)                                      
#define CAN_FS1R_FSC3_Msk      (0x1UL << CAN_FS1R_FSC3_Pos)              
#define CAN_FS1R_FSC3          CAN_FS1R_FSC3_Msk                         
#define CAN_FS1R_FSC4_Pos      (4U)                                      
#define CAN_FS1R_FSC4_Msk      (0x1UL << CAN_FS1R_FSC4_Pos)              
#define CAN_FS1R_FSC4          CAN_FS1R_FSC4_Msk                         
#define CAN_FS1R_FSC5_Pos      (5U)                                      
#define CAN_FS1R_FSC5_Msk      (0x1UL << CAN_FS1R_FSC5_Pos)              
#define CAN_FS1R_FSC5          CAN_FS1R_FSC5_Msk                         
#define CAN_FS1R_FSC6_Pos      (6U)                                      
#define CAN_FS1R_FSC6_Msk      (0x1UL << CAN_FS1R_FSC6_Pos)              
#define CAN_FS1R_FSC6          CAN_FS1R_FSC6_Msk                         
#define CAN_FS1R_FSC7_Pos      (7U)                                      
#define CAN_FS1R_FSC7_Msk      (0x1UL << CAN_FS1R_FSC7_Pos)              
#define CAN_FS1R_FSC7          CAN_FS1R_FSC7_Msk                         
#define CAN_FS1R_FSC8_Pos      (8U)                                      
#define CAN_FS1R_FSC8_Msk      (0x1UL << CAN_FS1R_FSC8_Pos)              
#define CAN_FS1R_FSC8          CAN_FS1R_FSC8_Msk                         
#define CAN_FS1R_FSC9_Pos      (9U)                                      
#define CAN_FS1R_FSC9_Msk      (0x1UL << CAN_FS1R_FSC9_Pos)              
#define CAN_FS1R_FSC9          CAN_FS1R_FSC9_Msk                         
#define CAN_FS1R_FSC10_Pos     (10U)                                     
#define CAN_FS1R_FSC10_Msk     (0x1UL << CAN_FS1R_FSC10_Pos)             
#define CAN_FS1R_FSC10         CAN_FS1R_FSC10_Msk                        
#define CAN_FS1R_FSC11_Pos     (11U)                                     
#define CAN_FS1R_FSC11_Msk     (0x1UL << CAN_FS1R_FSC11_Pos)             
#define CAN_FS1R_FSC11         CAN_FS1R_FSC11_Msk                           
#define CAN_FS1R_FSC12_Pos     (12U)                                        
#define CAN_FS1R_FSC12_Msk     (0x1UL << CAN_FS1R_FSC12_Pos)                
#define CAN_FS1R_FSC12         CAN_FS1R_FSC12_Msk                           
#define CAN_FS1R_FSC13_Pos     (13U)                                        
#define CAN_FS1R_FSC13_Msk     (0x1UL << CAN_FS1R_FSC13_Pos)                
#define CAN_FS1R_FSC13         CAN_FS1R_FSC13_Msk                           
#define CAN_FS1R_FSC14_Pos     (14U)                                        
#define CAN_FS1R_FSC14_Msk     (0x1UL << CAN_FS1R_FSC14_Pos)                
#define CAN_FS1R_FSC14         CAN_FS1R_FSC14_Msk                           
#define CAN_FS1R_FSC15_Pos     (15U)                                        
#define CAN_FS1R_FSC15_Msk     (0x1UL << CAN_FS1R_FSC15_Pos)                
#define CAN_FS1R_FSC15         CAN_FS1R_FSC15_Msk                           
#define CAN_FS1R_FSC16_Pos     (16U)                                        
#define CAN_FS1R_FSC16_Msk     (0x1UL << CAN_FS1R_FSC16_Pos)                
#define CAN_FS1R_FSC16         CAN_FS1R_FSC16_Msk                           
#define CAN_FS1R_FSC17_Pos     (17U)                                        
#define CAN_FS1R_FSC17_Msk     (0x1UL << CAN_FS1R_FSC17_Pos)                
#define CAN_FS1R_FSC17         CAN_FS1R_FSC17_Msk                           
#define CAN_FS1R_FSC18_Pos     (18U)                                        
#define CAN_FS1R_FSC18_Msk     (0x1UL << CAN_FS1R_FSC18_Pos)                
#define CAN_FS1R_FSC18         CAN_FS1R_FSC18_Msk                           
#define CAN_FS1R_FSC19_Pos     (19U)                                        
#define CAN_FS1R_FSC19_Msk     (0x1UL << CAN_FS1R_FSC19_Pos)                
#define CAN_FS1R_FSC19         CAN_FS1R_FSC19_Msk                           
#define CAN_FS1R_FSC20_Pos     (20U)                                        
#define CAN_FS1R_FSC20_Msk     (0x1UL << CAN_FS1R_FSC20_Pos)                
#define CAN_FS1R_FSC20         CAN_FS1R_FSC20_Msk                           
#define CAN_FS1R_FSC21_Pos     (21U)                                        
#define CAN_FS1R_FSC21_Msk     (0x1UL << CAN_FS1R_FSC21_Pos)                
#define CAN_FS1R_FSC21         CAN_FS1R_FSC21_Msk                           
#define CAN_FS1R_FSC22_Pos     (22U)                                        
#define CAN_FS1R_FSC22_Msk     (0x1UL << CAN_FS1R_FSC22_Pos)                
#define CAN_FS1R_FSC22         CAN_FS1R_FSC22_Msk                           
#define CAN_FS1R_FSC23_Pos     (23U)                                        
#define CAN_FS1R_FSC23_Msk     (0x1UL << CAN_FS1R_FSC23_Pos)                
#define CAN_FS1R_FSC23         CAN_FS1R_FSC23_Msk                           
#define CAN_FS1R_FSC24_Pos     (24U)                                        
#define CAN_FS1R_FSC24_Msk     (0x1UL << CAN_FS1R_FSC24_Pos)              
#define CAN_FS1R_FSC24         CAN_FS1R_FSC24_Msk                         
#define CAN_FS1R_FSC25_Pos     (25U)                                      
#define CAN_FS1R_FSC25_Msk     (0x1UL << CAN_FS1R_FSC25_Pos)              
#define CAN_FS1R_FSC25         CAN_FS1R_FSC25_Msk                         
#define CAN_FS1R_FSC26_Pos     (26U)                                      
#define CAN_FS1R_FSC26_Msk     (0x1UL << CAN_FS1R_FSC26_Pos)              
#define CAN_FS1R_FSC26         CAN_FS1R_FSC26_Msk                         
#define CAN_FS1R_FSC27_Pos     (27U)                                      
#define CAN_FS1R_FSC27_Msk     (0x1UL << CAN_FS1R_FSC27_Pos)              
#define CAN_FS1R_FSC27         CAN_FS1R_FSC27_Msk                         

/******************  Bit definition for CAN_FFA1R register  *******************/
#define CAN_FFA1R_FFA_Pos      (0U)                                            
#define CAN_FFA1R_FFA_Msk      (0xFFFFFFFUL << CAN_FFA1R_FFA_Pos)         
#define CAN_FFA1R_FFA          CAN_FFA1R_FFA_Msk                          
#define CAN_FFA1R_FFA0_Pos     (0U)                                       
#define CAN_FFA1R_FFA0_Msk     (0x1UL << CAN_FFA1R_FFA0_Pos)              
#define CAN_FFA1R_FFA0         CAN_FFA1R_FFA0_Msk                         
#define CAN_FFA1R_FFA1_Pos     (1U)                                       
#define CAN_FFA1R_FFA1_Msk     (0x1UL << CAN_FFA1R_FFA1_Pos)              
#define CAN_FFA1R_FFA1         CAN_FFA1R_FFA1_Msk                         
#define CAN_FFA1R_FFA2_Pos     (2U)                                       
#define CAN_FFA1R_FFA2_Msk     (0x1UL << CAN_FFA1R_FFA2_Pos)              
#define CAN_FFA1R_FFA2         CAN_FFA1R_FFA2_Msk                         
#define CAN_FFA1R_FFA3_Pos     (3U)                                       
#define CAN_FFA1R_FFA3_Msk     (0x1UL << CAN_FFA1R_FFA3_Pos)              
#define CAN_FFA1R_FFA3         CAN_FFA1R_FFA3_Msk                         
#define CAN_FFA1R_FFA4_Pos     (4U)                                       
#define CAN_FFA1R_FFA4_Msk     (0x1UL << CAN_FFA1R_FFA4_Pos)              
#define CAN_FFA1R_FFA4         CAN_FFA1R_FFA4_Msk                         
#define CAN_FFA1R_FFA5_Pos     (5U)                                       
#define CAN_FFA1R_FFA5_Msk     (0x1UL << CAN_FFA1R_FFA5_Pos)              
#define CAN_FFA1R_FFA5         CAN_FFA1R_FFA5_Msk                         
#define CAN_FFA1R_FFA6_Pos     (6U)                                       
#define CAN_FFA1R_FFA6_Msk     (0x1UL << CAN_FFA1R_FFA6_Pos)              
#define CAN_FFA1R_FFA6         CAN_FFA1R_FFA6_Msk                         
#define CAN_FFA1R_FFA7_Pos     (7U)                                       
#define CAN_FFA1R_FFA7_Msk     (0x1UL << CAN_FFA1R_FFA7_Pos)              
#define CAN_FFA1R_FFA7         CAN_FFA1R_FFA7_Msk                         
#define CAN_FFA1R_FFA8_Pos     (8U)                                       
#define CAN_FFA1R_FFA8_Msk     (0x1UL << CAN_FFA1R_FFA8_Pos)              
#define CAN_FFA1R_FFA8         CAN_FFA1R_FFA8_Msk                         
#define CAN_FFA1R_FFA9_Pos     (9U)                                       
#define CAN_FFA1R_FFA9_Msk     (0x1UL << CAN_FFA1R_FFA9_Pos)              
#define CAN_FFA1R_FFA9         CAN_FFA1R_FFA9_Msk                         
#define CAN_FFA1R_FFA10_Pos    (10U)                                      
#define CAN_FFA1R_FFA10_Msk    (0x1UL << CAN_FFA1R_FFA10_Pos)             
#define CAN_FFA1R_FFA10        CAN_FFA1R_FFA10_Msk                        
#define CAN_FFA1R_FFA11_Pos    (11U)                                      
#define CAN_FFA1R_FFA11_Msk    (0x1UL << CAN_FFA1R_FFA11_Pos)             
#define CAN_FFA1R_FFA11        CAN_FFA1R_FFA11_Msk                        
#define CAN_FFA1R_FFA12_Pos    (12U)                                      
#define CAN_FFA1R_FFA12_Msk    (0x1UL << CAN_FFA1R_FFA12_Pos)             
#define CAN_FFA1R_FFA12        CAN_FFA1R_FFA12_Msk                        
#define CAN_FFA1R_FFA13_Pos    (13U)                                      
#define CAN_FFA1R_FFA13_Msk    (0x1UL << CAN_FFA1R_FFA13_Pos)             
#define CAN_FFA1R_FFA13        CAN_FFA1R_FFA13_Msk                        
#define CAN_FFA1R_FFA14_Pos    (14U)                                      
#define CAN_FFA1R_FFA14_Msk    (0x1UL << CAN_FFA1R_FFA14_Pos)             
#define CAN_FFA1R_FFA14        CAN_FFA1R_FFA14_Msk                        
#define CAN_FFA1R_FFA15_Pos    (15U)                                      
#define CAN_FFA1R_FFA15_Msk    (0x1UL << CAN_FFA1R_FFA15_Pos)             
#define CAN_FFA1R_FFA15        CAN_FFA1R_FFA15_Msk                        
#define CAN_FFA1R_FFA16_Pos    (16U)                                      
#define CAN_FFA1R_FFA16_Msk    (0x1UL << CAN_FFA1R_FFA16_Pos)             
#define CAN_FFA1R_FFA16        CAN_FFA1R_FFA16_Msk                        
#define CAN_FFA1R_FFA17_Pos    (17U)                                      
#define CAN_FFA1R_FFA17_Msk    (0x1UL << CAN_FFA1R_FFA17_Pos)             
#define CAN_FFA1R_FFA17        CAN_FFA1R_FFA17_Msk                        
#define CAN_FFA1R_FFA18_Pos    (18U)                                      
#define CAN_FFA1R_FFA18_Msk    (0x1UL << CAN_FFA1R_FFA18_Pos)             
#define CAN_FFA1R_FFA18        CAN_FFA1R_FFA18_Msk                        
#define CAN_FFA1R_FFA19_Pos    (19U)                                      
#define CAN_FFA1R_FFA19_Msk    (0x1UL << CAN_FFA1R_FFA19_Pos)             
#define CAN_FFA1R_FFA19        CAN_FFA1R_FFA19_Msk                        
#define CAN_FFA1R_FFA20_Pos    (20U)                                      
#define CAN_FFA1R_FFA20_Msk    (0x1UL << CAN_FFA1R_FFA20_Pos)             
#define CAN_FFA1R_FFA20        CAN_FFA1R_FFA20_Msk                        
#define CAN_FFA1R_FFA21_Pos    (21U)                                      
#define CAN_FFA1R_FFA21_Msk    (0x1UL << CAN_FFA1R_FFA21_Pos)             
#define CAN_FFA1R_FFA21        CAN_FFA1R_FFA21_Msk                        
#define CAN_FFA1R_FFA22_Pos    (22U)                                      
#define CAN_FFA1R_FFA22_Msk    (0x1UL << CAN_FFA1R_FFA22_Pos)             
#define CAN_FFA1R_FFA22        CAN_FFA1R_FFA22_Msk                        
#define CAN_FFA1R_FFA23_Pos    (23U)                                      
#define CAN_FFA1R_FFA23_Msk    (0x1UL << CAN_FFA1R_FFA23_Pos)             
#define CAN_FFA1R_FFA23        CAN_FFA1R_FFA23_Msk                        
#define CAN_FFA1R_FFA24_Pos    (24U)                                      
#define CAN_FFA1R_FFA24_Msk    (0x1UL << CAN_FFA1R_FFA24_Pos)             
#define CAN_FFA1R_FFA24        CAN_FFA1R_FFA24_Msk                        
#define CAN_FFA1R_FFA25_Pos    (25U)                                      
#define CAN_FFA1R_FFA25_Msk    (0x1UL << CAN_FFA1R_FFA25_Pos)             
#define CAN_FFA1R_FFA25        CAN_FFA1R_FFA25_Msk                        
#define CAN_FFA1R_FFA26_Pos    (26U)                                      
#define CAN_FFA1R_FFA26_Msk    (0x1UL << CAN_FFA1R_FFA26_Pos)             
#define CAN_FFA1R_FFA26        CAN_FFA1R_FFA26_Msk                        
#define CAN_FFA1R_FFA27_Pos    (27U)                                      
#define CAN_FFA1R_FFA27_Msk    (0x1UL << CAN_FFA1R_FFA27_Pos)             
#define CAN_FFA1R_FFA27        CAN_FFA1R_FFA27_Msk                        

