sownlee/MCAL/env/STM32F407VG/header/Header_CAN.h
/*******************  Bit definition for CAN_F8R1 register  *******************/
#define CAN_F8R1_FB0_Pos       (0U)                                            
#define CAN_F8R1_FB0_Msk       (0x1UL << CAN_F8R1_FB0_Pos)                      
#define CAN_F8R1_FB0           CAN_F8R1_FB0_Msk                               
#define CAN_F8R1_FB1_Pos       (1U)                                           
#define CAN_F8R1_FB1_Msk       (0x1UL << CAN_F8R1_FB1_Pos)                    
#define CAN_F8R1_FB1           CAN_F8R1_FB1_Msk                               
#define CAN_F8R1_FB2_Pos       (2U)                                           
#define CAN_F8R1_FB2_Msk       (0x1UL << CAN_F8R1_FB2_Pos)                    
#define CAN_F8R1_FB2           CAN_F8R1_FB2_Msk                               
#define CAN_F8R1_FB3_Pos       (3U)                                           
#define CAN_F8R1_FB3_Msk       (0x1UL << CAN_F8R1_FB3_Pos)                    
#define CAN_F8R1_FB3           CAN_F8R1_FB3_Msk                               
#define CAN_F8R1_FB4_Pos       (4U)                                           
#define CAN_F8R1_FB4_Msk       (0x1UL << CAN_F8R1_FB4_Pos)                    
#define CAN_F8R1_FB4           CAN_F8R1_FB4_Msk                               
#define CAN_F8R1_FB5_Pos       (5U)                                           
#define CAN_F8R1_FB5_Msk       (0x1UL << CAN_F8R1_FB5_Pos)                    
#define CAN_F8R1_FB5           CAN_F8R1_FB5_Msk                               
#define CAN_F8R1_FB6_Pos       (6U)                                           
#define CAN_F8R1_FB6_Msk       (0x1UL << CAN_F8R1_FB6_Pos)                    
#define CAN_F8R1_FB6           CAN_F8R1_FB6_Msk                               
#define CAN_F8R1_FB7_Pos       (7U)                                           
#define CAN_F8R1_FB7_Msk       (0x1UL << CAN_F8R1_FB7_Pos)                    
#define CAN_F8R1_FB7           CAN_F8R1_FB7_Msk                               
#define CAN_F8R1_FB8_Pos       (8U)                                           
#define CAN_F8R1_FB8_Msk       (0x1UL << CAN_F8R1_FB8_Pos)                    
#define CAN_F8R1_FB8           CAN_F8R1_FB8_Msk                               
#define CAN_F8R1_FB9_Pos       (9U)                                           
#define CAN_F8R1_FB9_Msk       (0x1UL << CAN_F8R1_FB9_Pos)                    
#define CAN_F8R1_FB9           CAN_F8R1_FB9_Msk                               
#define CAN_F8R1_FB10_Pos      (10U)                                          
#define CAN_F8R1_FB10_Msk      (0x1UL << CAN_F8R1_FB10_Pos)                   
#define CAN_F8R1_FB10          CAN_F8R1_FB10_Msk                              
#define CAN_F8R1_FB11_Pos      (11U)                                          
#define CAN_F8R1_FB11_Msk      (0x1UL << CAN_F8R1_FB11_Pos)                   
#define CAN_F8R1_FB11          CAN_F8R1_FB11_Msk                              
#define CAN_F8R1_FB12_Pos      (12U)                                          
#define CAN_F8R1_FB12_Msk      (0x1UL << CAN_F8R1_FB12_Pos)                   
#define CAN_F8R1_FB12          CAN_F8R1_FB12_Msk                              
#define CAN_F8R1_FB13_Pos      (13U)                                          
#define CAN_F8R1_FB13_Msk      (0x1UL << CAN_F8R1_FB13_Pos)                   
#define CAN_F8R1_FB13          CAN_F8R1_FB13_Msk                              
#define CAN_F8R1_FB14_Pos      (14U)                                          
#define CAN_F8R1_FB14_Msk      (0x1UL << CAN_F8R1_FB14_Pos)                   
#define CAN_F8R1_FB14          CAN_F8R1_FB14_Msk                              
#define CAN_F8R1_FB15_Pos      (15U)                                          
#define CAN_F8R1_FB15_Msk      (0x1UL << CAN_F8R1_FB15_Pos)                   
#define CAN_F8R1_FB15          CAN_F8R1_FB15_Msk                              
#define CAN_F8R1_FB16_Pos      (16U)                                          
#define CAN_F8R1_FB16_Msk      (0x1UL << CAN_F8R1_FB16_Pos)                   
#define CAN_F8R1_FB16          CAN_F8R1_FB16_Msk                              
#define CAN_F8R1_FB17_Pos      (17U)                                          
#define CAN_F8R1_FB17_Msk      (0x1UL << CAN_F8R1_FB17_Pos)                   
#define CAN_F8R1_FB17          CAN_F8R1_FB17_Msk                              
#define CAN_F8R1_FB18_Pos      (18U)                                          
#define CAN_F8R1_FB18_Msk      (0x1UL << CAN_F8R1_FB18_Pos)                   
#define CAN_F8R1_FB18          CAN_F8R1_FB18_Msk                              
#define CAN_F8R1_FB19_Pos      (19U)                                          
#define CAN_F8R1_FB19_Msk      (0x1UL << CAN_F8R1_FB19_Pos)                   
#define CAN_F8R1_FB19          CAN_F8R1_FB19_Msk                              
#define CAN_F8R1_FB20_Pos      (20U)                                          
#define CAN_F8R1_FB20_Msk      (0x1UL << CAN_F8R1_FB20_Pos)                   
#define CAN_F8R1_FB20          CAN_F8R1_FB20_Msk                              
#define CAN_F8R1_FB21_Pos      (21U)                                          
#define CAN_F8R1_FB21_Msk      (0x1UL << CAN_F8R1_FB21_Pos)                   
#define CAN_F8R1_FB21          CAN_F8R1_FB21_Msk                              
#define CAN_F8R1_FB22_Pos      (22U)                                          
#define CAN_F8R1_FB22_Msk      (0x1UL << CAN_F8R1_FB22_Pos)                   
#define CAN_F8R1_FB22          CAN_F8R1_FB22_Msk                              
#define CAN_F8R1_FB23_Pos      (23U)                                          
#define CAN_F8R1_FB23_Msk      (0x1UL << CAN_F8R1_FB23_Pos)                   
#define CAN_F8R1_FB23          CAN_F8R1_FB23_Msk                              
#define CAN_F8R1_FB24_Pos      (24U)                                          
#define CAN_F8R1_FB24_Msk      (0x1UL << CAN_F8R1_FB24_Pos)                   
#define CAN_F8R1_FB24          CAN_F8R1_FB24_Msk                              
#define CAN_F8R1_FB25_Pos      (25U)                                          
#define CAN_F8R1_FB25_Msk      (0x1UL << CAN_F8R1_FB25_Pos)                   
#define CAN_F8R1_FB25          CAN_F8R1_FB25_Msk                              
#define CAN_F8R1_FB26_Pos      (26U)                                          
#define CAN_F8R1_FB26_Msk      (0x1UL << CAN_F8R1_FB26_Pos)                   
#define CAN_F8R1_FB26          CAN_F8R1_FB26_Msk                              
#define CAN_F8R1_FB27_Pos      (27U)                                          
#define CAN_F8R1_FB27_Msk      (0x1UL << CAN_F8R1_FB27_Pos)                   
#define CAN_F8R1_FB27          CAN_F8R1_FB27_Msk                              
#define CAN_F8R1_FB28_Pos      (28U)                                          
#define CAN_F8R1_FB28_Msk      (0x1UL << CAN_F8R1_FB28_Pos)                   
#define CAN_F8R1_FB28          CAN_F8R1_FB28_Msk                              
#define CAN_F8R1_FB29_Pos      (29U)                                          
#define CAN_F8R1_FB29_Msk      (0x1UL << CAN_F8R1_FB29_Pos)                   
#define CAN_F8R1_FB29          CAN_F8R1_FB29_Msk                              
#define CAN_F8R1_FB30_Pos      (30U)                                          
#define CAN_F8R1_FB30_Msk      (0x1UL << CAN_F8R1_FB30_Pos)                   
#define CAN_F8R1_FB30          CAN_F8R1_FB30_Msk                              
#define CAN_F8R1_FB31_Pos      (31U)                                          
#define CAN_F8R1_FB31_Msk      (0x1UL << CAN_F8R1_FB31_Pos)                   
#define CAN_F8R1_FB31          CAN_F8R1_FB31_Msk                              

/*******************  Bit definition for CAN_F9R1 register  *******************/
#define CAN_F9R1_FB0_Pos       (0U)                                            
#define CAN_F9R1_FB0_Msk       (0x1UL << CAN_F9R1_FB0_Pos)                      
#define CAN_F9R1_FB0           CAN_F9R1_FB0_Msk                               
#define CAN_F9R1_FB1_Pos       (1U)                                           
#define CAN_F9R1_FB1_Msk       (0x1UL << CAN_F9R1_FB1_Pos)                    
#define CAN_F9R1_FB1           CAN_F9R1_FB1_Msk                               
#define CAN_F9R1_FB2_Pos       (2U)                                           
#define CAN_F9R1_FB2_Msk       (0x1UL << CAN_F9R1_FB2_Pos)                    
#define CAN_F9R1_FB2           CAN_F9R1_FB2_Msk                               
#define CAN_F9R1_FB3_Pos       (3U)                                           
#define CAN_F9R1_FB3_Msk       (0x1UL << CAN_F9R1_FB3_Pos)                    
#define CAN_F9R1_FB3           CAN_F9R1_FB3_Msk                               
#define CAN_F9R1_FB4_Pos       (4U)                                           
#define CAN_F9R1_FB4_Msk       (0x1UL << CAN_F9R1_FB4_Pos)                    
#define CAN_F9R1_FB4           CAN_F9R1_FB4_Msk                               
#define CAN_F9R1_FB5_Pos       (5U)                                           
#define CAN_F9R1_FB5_Msk       (0x1UL << CAN_F9R1_FB5_Pos)                    
#define CAN_F9R1_FB5           CAN_F9R1_FB5_Msk                               
#define CAN_F9R1_FB6_Pos       (6U)                                           
#define CAN_F9R1_FB6_Msk       (0x1UL << CAN_F9R1_FB6_Pos)                    
#define CAN_F9R1_FB6           CAN_F9R1_FB6_Msk                               
#define CAN_F9R1_FB7_Pos       (7U)                                           
#define CAN_F9R1_FB7_Msk       (0x1UL << CAN_F9R1_FB7_Pos)                    
#define CAN_F9R1_FB7           CAN_F9R1_FB7_Msk                               
#define CAN_F9R1_FB8_Pos       (8U)                                           
#define CAN_F9R1_FB8_Msk       (0x1UL << CAN_F9R1_FB8_Pos)                    
#define CAN_F9R1_FB8           CAN_F9R1_FB8_Msk                               
#define CAN_F9R1_FB9_Pos       (9U)                                           
#define CAN_F9R1_FB9_Msk       (0x1UL << CAN_F9R1_FB9_Pos)                    
#define CAN_F9R1_FB9           CAN_F9R1_FB9_Msk                               
#define CAN_F9R1_FB10_Pos      (10U)                                          
#define CAN_F9R1_FB10_Msk      (0x1UL << CAN_F9R1_FB10_Pos)                   
#define CAN_F9R1_FB10          CAN_F9R1_FB10_Msk                              
#define CAN_F9R1_FB11_Pos      (11U)                                          
#define CAN_F9R1_FB11_Msk      (0x1UL << CAN_F9R1_FB11_Pos)                   
#define CAN_F9R1_FB11          CAN_F9R1_FB11_Msk                              
#define CAN_F9R1_FB12_Pos      (12U)                                          
#define CAN_F9R1_FB12_Msk      (0x1UL << CAN_F9R1_FB12_Pos)                   
#define CAN_F9R1_FB12          CAN_F9R1_FB12_Msk                              
#define CAN_F9R1_FB13_Pos      (13U)                                          
#define CAN_F9R1_FB13_Msk      (0x1UL << CAN_F9R1_FB13_Pos)                   
#define CAN_F9R1_FB13          CAN_F9R1_FB13_Msk                              
#define CAN_F9R1_FB14_Pos      (14U)                                          
#define CAN_F9R1_FB14_Msk      (0x1UL << CAN_F9R1_FB14_Pos)                   
#define CAN_F9R1_FB14          CAN_F9R1_FB14_Msk                              
#define CAN_F9R1_FB15_Pos      (15U)                                          
#define CAN_F9R1_FB15_Msk      (0x1UL << CAN_F9R1_FB15_Pos)                   
#define CAN_F9R1_FB15          CAN_F9R1_FB15_Msk                              
#define CAN_F9R1_FB16_Pos      (16U)                                          
#define CAN_F9R1_FB16_Msk      (0x1UL << CAN_F9R1_FB16_Pos)                   
#define CAN_F9R1_FB16          CAN_F9R1_FB16_Msk                              
#define CAN_F9R1_FB17_Pos      (17U)                                          
#define CAN_F9R1_FB17_Msk      (0x1UL << CAN_F9R1_FB17_Pos)                   
#define CAN_F9R1_FB17          CAN_F9R1_FB17_Msk                              
#define CAN_F9R1_FB18_Pos      (18U)                                          
#define CAN_F9R1_FB18_Msk      (0x1UL << CAN_F9R1_FB18_Pos)                   
#define CAN_F9R1_FB18          CAN_F9R1_FB18_Msk                              
#define CAN_F9R1_FB19_Pos      (19U)                                          
#define CAN_F9R1_FB19_Msk      (0x1UL << CAN_F9R1_FB19_Pos)                   
#define CAN_F9R1_FB19          CAN_F9R1_FB19_Msk                              
#define CAN_F9R1_FB20_Pos      (20U)                                          
#define CAN_F9R1_FB20_Msk      (0x1UL << CAN_F9R1_FB20_Pos)                   
#define CAN_F9R1_FB20          CAN_F9R1_FB20_Msk                              
#define CAN_F9R1_FB21_Pos      (21U)                                          
#define CAN_F9R1_FB21_Msk      (0x1UL << CAN_F9R1_FB21_Pos)                   
#define CAN_F9R1_FB21          CAN_F9R1_FB21_Msk                              
#define CAN_F9R1_FB22_Pos      (22U)                                          
#define CAN_F9R1_FB22_Msk      (0x1UL << CAN_F9R1_FB22_Pos)                   
#define CAN_F9R1_FB22          CAN_F9R1_FB22_Msk                              
#define CAN_F9R1_FB23_Pos      (23U)                                          
#define CAN_F9R1_FB23_Msk      (0x1UL << CAN_F9R1_FB23_Pos)                   
#define CAN_F9R1_FB23          CAN_F9R1_FB23_Msk                              
#define CAN_F9R1_FB24_Pos      (24U)                                          
#define CAN_F9R1_FB24_Msk      (0x1UL << CAN_F9R1_FB24_Pos)                   
#define CAN_F9R1_FB24          CAN_F9R1_FB24_Msk                              
#define CAN_F9R1_FB25_Pos      (25U)                                          
#define CAN_F9R1_FB25_Msk      (0x1UL << CAN_F9R1_FB25_Pos)                   
#define CAN_F9R1_FB25          CAN_F9R1_FB25_Msk                              
#define CAN_F9R1_FB26_Pos      (26U)                                          
#define CAN_F9R1_FB26_Msk      (0x1UL << CAN_F9R1_FB26_Pos)                   
#define CAN_F9R1_FB26          CAN_F9R1_FB26_Msk                              
#define CAN_F9R1_FB27_Pos      (27U)                                          
#define CAN_F9R1_FB27_Msk      (0x1UL << CAN_F9R1_FB27_Pos)                   
#define CAN_F9R1_FB27          CAN_F9R1_FB27_Msk                              
#define CAN_F9R1_FB28_Pos      (28U)                                          
#define CAN_F9R1_FB28_Msk      (0x1UL << CAN_F9R1_FB28_Pos)                   
#define CAN_F9R1_FB28          CAN_F9R1_FB28_Msk                              
#define CAN_F9R1_FB29_Pos      (29U)                                          
#define CAN_F9R1_FB29_Msk      (0x1UL << CAN_F9R1_FB29_Pos)                   
#define CAN_F9R1_FB29          CAN_F9R1_FB29_Msk                              
#define CAN_F9R1_FB30_Pos      (30U)                                          
#define CAN_F9R1_FB30_Msk      (0x1UL << CAN_F9R1_FB30_Pos)                   
#define CAN_F9R1_FB30          CAN_F9R1_FB30_Msk                              
#define CAN_F9R1_FB31_Pos      (31U)                                          
#define CAN_F9R1_FB31_Msk      (0x1UL << CAN_F9R1_FB31_Pos)                   
#define CAN_F9R1_FB31          CAN_F9R1_FB31_Msk                              

/*******************  Bit definition for CAN_F10R1 register  ******************/
#define CAN_F10R1_FB0_Pos      (0U)                                            
#define CAN_F10R1_FB0_Msk      (0x1UL << CAN_F10R1_FB0_Pos)                     
#define CAN_F10R1_FB0          CAN_F10R1_FB0_Msk                              
#define CAN_F10R1_FB1_Pos      (1U)                                           
#define CAN_F10R1_FB1_Msk      (0x1UL << CAN_F10R1_FB1_Pos)                   
#define CAN_F10R1_FB1          CAN_F10R1_FB1_Msk                              
#define CAN_F10R1_FB2_Pos      (2U)                                           
#define CAN_F10R1_FB2_Msk      (0x1UL << CAN_F10R1_FB2_Pos)                   
#define CAN_F10R1_FB2          CAN_F10R1_FB2_Msk                              
#define CAN_F10R1_FB3_Pos      (3U)                                           
#define CAN_F10R1_FB3_Msk      (0x1UL << CAN_F10R1_FB3_Pos)                   
#define CAN_F10R1_FB3          CAN_F10R1_FB3_Msk                              
#define CAN_F10R1_FB4_Pos      (4U)                                           
#define CAN_F10R1_FB4_Msk      (0x1UL << CAN_F10R1_FB4_Pos)                   
#define CAN_F10R1_FB4          CAN_F10R1_FB4_Msk                              
#define CAN_F10R1_FB5_Pos      (5U)                                           
#define CAN_F10R1_FB5_Msk      (0x1UL << CAN_F10R1_FB5_Pos)                   
#define CAN_F10R1_FB5          CAN_F10R1_FB5_Msk                              
#define CAN_F10R1_FB6_Pos      (6U)                                           
#define CAN_F10R1_FB6_Msk      (0x1UL << CAN_F10R1_FB6_Pos)                   
#define CAN_F10R1_FB6          CAN_F10R1_FB6_Msk                              
#define CAN_F10R1_FB7_Pos      (7U)                                           
#define CAN_F10R1_FB7_Msk      (0x1UL << CAN_F10R1_FB7_Pos)                   
#define CAN_F10R1_FB7          CAN_F10R1_FB7_Msk                              
#define CAN_F10R1_FB8_Pos      (8U)                                           
#define CAN_F10R1_FB8_Msk      (0x1UL << CAN_F10R1_FB8_Pos)                   
#define CAN_F10R1_FB8          CAN_F10R1_FB8_Msk                              
#define CAN_F10R1_FB9_Pos      (9U)                                           
#define CAN_F10R1_FB9_Msk      (0x1UL << CAN_F10R1_FB9_Pos)                   
#define CAN_F10R1_FB9          CAN_F10R1_FB9_Msk                              
#define CAN_F10R1_FB10_Pos     (10U)                                          
#define CAN_F10R1_FB10_Msk     (0x1UL << CAN_F10R1_FB10_Pos)                  
#define CAN_F10R1_FB10         CAN_F10R1_FB10_Msk                             
#define CAN_F10R1_FB11_Pos     (11U)                                          
#define CAN_F10R1_FB11_Msk     (0x1UL << CAN_F10R1_FB11_Pos)                  
#define CAN_F10R1_FB11         CAN_F10R1_FB11_Msk                             
#define CAN_F10R1_FB12_Pos     (12U)                                          
#define CAN_F10R1_FB12_Msk     (0x1UL << CAN_F10R1_FB12_Pos)                  
#define CAN_F10R1_FB12         CAN_F10R1_FB12_Msk                             
#define CAN_F10R1_FB13_Pos     (13U)                                          
#define CAN_F10R1_FB13_Msk     (0x1UL << CAN_F10R1_FB13_Pos)                  
#define CAN_F10R1_FB13         CAN_F10R1_FB13_Msk                             
#define CAN_F10R1_FB14_Pos     (14U)                                          
#define CAN_F10R1_FB14_Msk     (0x1UL << CAN_F10R1_FB14_Pos)                  
#define CAN_F10R1_FB14         CAN_F10R1_FB14_Msk                             
#define CAN_F10R1_FB15_Pos     (15U)                                          
#define CAN_F10R1_FB15_Msk     (0x1UL << CAN_F10R1_FB15_Pos)                  
#define CAN_F10R1_FB15         CAN_F10R1_FB15_Msk                             
#define CAN_F10R1_FB16_Pos     (16U)                                          
#define CAN_F10R1_FB16_Msk     (0x1UL << CAN_F10R1_FB16_Pos)                  
#define CAN_F10R1_FB16         CAN_F10R1_FB16_Msk                             
#define CAN_F10R1_FB17_Pos     (17U)                                          
#define CAN_F10R1_FB17_Msk     (0x1UL << CAN_F10R1_FB17_Pos)                  
#define CAN_F10R1_FB17         CAN_F10R1_FB17_Msk                             
#define CAN_F10R1_FB18_Pos     (18U)                                          
#define CAN_F10R1_FB18_Msk     (0x1UL << CAN_F10R1_FB18_Pos)                  
#define CAN_F10R1_FB18         CAN_F10R1_FB18_Msk                             
#define CAN_F10R1_FB19_Pos     (19U)                                          
#define CAN_F10R1_FB19_Msk     (0x1UL << CAN_F10R1_FB19_Pos)                  
#define CAN_F10R1_FB19         CAN_F10R1_FB19_Msk                             
#define CAN_F10R1_FB20_Pos     (20U)                                          
#define CAN_F10R1_FB20_Msk     (0x1UL << CAN_F10R1_FB20_Pos)                  
#define CAN_F10R1_FB20         CAN_F10R1_FB20_Msk                             
#define CAN_F10R1_FB21_Pos     (21U)                                          
#define CAN_F10R1_FB21_Msk     (0x1UL << CAN_F10R1_FB21_Pos)                  
#define CAN_F10R1_FB21         CAN_F10R1_FB21_Msk                             
#define CAN_F10R1_FB22_Pos     (22U)                                          
#define CAN_F10R1_FB22_Msk     (0x1UL << CAN_F10R1_FB22_Pos)                  
#define CAN_F10R1_FB22         CAN_F10R1_FB22_Msk                             
#define CAN_F10R1_FB23_Pos     (23U)                                          
#define CAN_F10R1_FB23_Msk     (0x1UL << CAN_F10R1_FB23_Pos)                  
#define CAN_F10R1_FB23         CAN_F10R1_FB23_Msk                             
#define CAN_F10R1_FB24_Pos     (24U)                                          
#define CAN_F10R1_FB24_Msk     (0x1UL << CAN_F10R1_FB24_Pos)                  
#define CAN_F10R1_FB24         CAN_F10R1_FB24_Msk                             
#define CAN_F10R1_FB25_Pos     (25U)                                          
#define CAN_F10R1_FB25_Msk     (0x1UL << CAN_F10R1_FB25_Pos)                  
#define CAN_F10R1_FB25         CAN_F10R1_FB25_Msk                             
#define CAN_F10R1_FB26_Pos     (26U)                                          
#define CAN_F10R1_FB26_Msk     (0x1UL << CAN_F10R1_FB26_Pos)                  
#define CAN_F10R1_FB26         CAN_F10R1_FB26_Msk                             
#define CAN_F10R1_FB27_Pos     (27U)                                          
#define CAN_F10R1_FB27_Msk     (0x1UL << CAN_F10R1_FB27_Pos)                  
#define CAN_F10R1_FB27         CAN_F10R1_FB27_Msk                             
#define CAN_F10R1_FB28_Pos     (28U)                                          
#define CAN_F10R1_FB28_Msk     (0x1UL << CAN_F10R1_FB28_Pos)                  
#define CAN_F10R1_FB28         CAN_F10R1_FB28_Msk                             
#define CAN_F10R1_FB29_Pos     (29U)                                          
#define CAN_F10R1_FB29_Msk     (0x1UL << CAN_F10R1_FB29_Pos)                  
#define CAN_F10R1_FB29         CAN_F10R1_FB29_Msk                             
#define CAN_F10R1_FB30_Pos     (30U)                                          
#define CAN_F10R1_FB30_Msk     (0x1UL << CAN_F10R1_FB30_Pos)                  
#define CAN_F10R1_FB30         CAN_F10R1_FB30_Msk                             
#define CAN_F10R1_FB31_Pos     (31U)                                          
#define CAN_F10R1_FB31_Msk     (0x1UL << CAN_F10R1_FB31_Pos)                  
#define CAN_F10R1_FB31         CAN_F10R1_FB31_Msk                             

